blog_api/app/controllers/api/v1/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "はじめての投稿2-2"], ["content", "はじめた2-2"], ["created_at", "2023-06-23 15:25:44.542934"], ["updated_at", "2023-06-23 15:25:44.542934"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "はじめての投稿2-2"], ["content", "はじめた2-2"], ["updated_at", "2023-06-23 13:58:10.336072"], ["id", 2]]